"Bass Frequency" = "Frequenza bassi"; 
"Bass Gain" = "Guadagno bassi"; 
"Low Mid Frequency" = "Frequenza medi bassa";
"Low Mid Gain" = "Guadagno medio basso";
"High Mid Frequency" = "Frequenza medi alta";
"High Mid Gain" = "Guadagno medi alto";
"Treble Frequency" = "Frequenza alti";
"Treble Gain" = "Guadagno alti";
